Repository: Zaid-Amaneh/Oxytocin
Catalog: lib/l10n/app_*.arb
Languages: ar

# updateBookingFailed
source: Failed to update your booking. Please try again later.
ar: فشل تعديل حجزك. يرجى المحاولة لاحقًا.

# editUploadedFiles
source: Edit Files
ar: تعديل الملفات

# rebookingSuccess
source: Your booking has been successfully rescheduled after cancellation.
ar: تمت إعادة حجزك بنجاح بعد الإلغاء.

# rebookingFailed
source: Rebooking failed, the requested time slot is already taken.
ar: تعذّرت إعادة حجزك، الموعد المطلوب أصبح مشغولاً.

# fileOpenFailed
source: Failed to load or open the file
ar: فشل تحميل أو فتح الملف

# fileLoadedNoViewer
source: The file is loaded but no viewer is available to open it.
ar: تم التحميل ولا يوجد عارض مناسب لفتح الملف.

source: Manage Attachments
ar: إدارة الملفات المرفقة

source: Attachments
ar: الملفات المرفقة

# attachmentsCount
source: {count} of 5 files
ar: {count} من 5 ملفات

source: Uploading...
ar: جاري الرفع...

source: Add File
ar: إضافة ملف

source: Loading files...
ar: جاري تحميل الملفات...

# noAttachments
source: No attachments available
ar: لا توجد ملفات مرفقة

# addFileHint
source: Press the 'Add File' button to upload your files
ar: اضغط على زر "إضافة ملف" لرفع ملفاتك

source: Delete File
ar: حذف الملف

# maxFilesError
source: You cannot upload more than 5 files
ar: لا يمكن رفع أكثر من 5 ملفات

source: Upload Alerts
ar: تنبيهات الرفع

# fileSelectionError
source: An error occurred while selecting files
ar: حدث خطأ أثناء اختيار الملفات

source: OK
ar: موافق

# deleteConfirmationQuestion
source: Are you sure you want to delete this file?
ar: هل أنت متأكد من حذف هذا الملف؟

source: Delete Confirmation
ar: تأكيد الحذف

source: Delete
ar: حذف

source: Canceled
ar: ألغى

source: Absent
ar: غائب

source: Waiting
ar: ينتظر

source: In Examination
ar: يُفحص الآن

source: Finished
ar: انتهى

# enteredAt
source: Entered at: {time}
ar: دخل: {time}

# exitedAt
source: Exited at: {time}
ar: خرج: {time}

# appointmentAt
source: Appointment: {time}
ar: الموعد: {time}

source: You
ar: أنت

# patientNumber
source: Patient No. {number}
ar: مريض رقم {number}

source: In Queue
ar: في الانتظار

source: Your Position
ar: موقعك

source: Completed
ar: مكتمل

# queueProgress
source: {progress} of {total}
ar: {progress} من {total}

# queueProgressText
source: Queue Progress
ar: تقدم الطابور

source: Close
ar: إغلاق

# averageDelay
source: Average Delay: {minutes}m
ar: متوسط التأخير: {minutes}د

# averageExamination
source: Average Examination: {minutes}m
ar: متوسط الفحص: {minutes}د

# yourNumber
source: Your Number: {number}
ar: رقمك: {number}

# estimatedWait
source: Approximately {minutes} minutes
ar: {minutes} دقيقة تقريباً

# expectedWaitTime
source: Expected Waiting Time
ar: الوقت المتوقع للانتظار

source: Waiting Queue
ar: طابور الانتظار

# queueLoading
source: Loading queue data...
ar: جاري تحميل بيانات الطابور...

# pleaseWait
source: Please wait a moment
ar: يرجى الانتظار قليلاً

# queueLoadFailed
source: Failed to load queue
ar: فشل في تحميل الطابور

# serverError
source: Could not connect to the server. Please check your internet connection.
ar: تعذر الاتصال بالخادم. يرجى التحقق من الاتصال بالإنترنت.

# noQueue
source: No queue available
ar: لا يوجد طابور حالياً

# doctorUnavailable
source: Dr. {doctorName} is currently unavailable or no appointments are scheduled
ar: د. {doctorName} غير متاح حالياً أو لا توجد مواعيد مجدولة

# checkLater
source: You can come back later to check the queue status
ar: يمكنك العودة لاحقاً للتحقق من حالة الطابور

source: Unknown state
ar: حالة غير معروفة

# unexpectedError
source: An unexpected error occurred, please try again
ar: حدث خطأ غير متوقع، يرجى المحاولة مرة أخرى

# cancelAppointment
source: Yes, cancel the appointment
ar: نعم، إلغاء الموعد

source: Back
ar: تراجع

# confirmCancel
source: Confirm cancellation
ar: تأكيد الإلغاء

# cancelConfirmationMsg
source: Are you sure you want to cancel this appointment? You will not be able to undo this action.
ar: هل أنت متأكد من إلغاء هذا الموعد؟ لن تتمكن من التراجع عن هذا الإجراء.

# cancelAppointmentPermanently
source: Cancel the appointment permanently
ar: إلغاء الموعد نهائياً

# addRemovemanageAttachments
source: Add or remove attachments
ar: إضافة أو حذف الملفات المرفقة

# changeAppointmentDateTime
source: Change appointment date or time
ar: تغيير تاريخ أو وقت الموعد

# noCurrentAppointments
source: You have no current appointments
ar: لا يوجد أي مواعيد حالية

# noPastAppointments
source: You have no past appointments
ar: لا يوجد أي مواعيد سابقة

# noCancelledAppointments
source: You have no cancelled appointments
ar: لا يوجد أي مواعيد ملغاة

# patientBannedTitle
source: Patient Banned
ar: تم حظر المريض

# patientBannedDescription
source: This account has been banned by the clinic. Please contact the clinic to remove the ban or if you believe this ban was applied by mistake.
ar: لقد قامت العيادة بحظر هذا الحساب. يمكنك التواصل مع العيادة لإزالة الحظر أو في حال كنت تظن أنه قد تم حظرك عن طريق الخطأ.
