Repository: Zaid-Amaneh/Oxytocin
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Oxytocin
ar: أوكسيتوسين

# findPerfectDoctor
source: Find Your Perfect Doctor
ar: اعثر على طبيبك المثالي

# findPerfectDoctorDes
source: Browse trusted doctors' profiles and choose the one that suits your needs with confidence and ease.
ar: تصفّح ملفات الأطباء الموثوقين واختر من يناسب احتياجاتك بثقة وسهولة.

# medicalRecordInYourHand
source: Your Medical Record in Your Hand
ar: سجلك الطبي في متناولك

# medicalRecordInYourHandDes
source: Track your health history and medical records anytime, securely.
ar: تابع تاريخك الصحي وملفاتك الطبية في أي وقت وبكل أمان.

# yourPrivacyProtected
source: Your Privacy is Always Protected
ar: خصوصيتك محمية دائمًا

# yourPrivacyProtectedDes
source: All your health information is encrypted and secure. Your privacy is our priority.
ar: كل معلوماتك الصحية مشفّرة وآمنة,خصوصيتك أولويتنا.

source: Next
ar: التالي

source: Skip
ar: تخطي

source: Start Now
ar: ابدأ الآن

source: Sign Up
ar: إنشاء حساب

source: Sign In
ar: تسجيل الدخول

source: Password
ar: كلمة المرور

source: Phone Number
ar: رقم الهاتف

# pleaseEnterValidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صالح

# passwordatleast8characterslong
source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

source: Password is required
ar: كلمة المرور مطلوبة

# passwordincludeleastonelowercaseletter
source: Password must include at least one lowercase letter
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل

# passwordincludeleastoneuppercaseletter
source: Password must include at least one uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل

source: Password must include at least one number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل

# passwordmustleastonespecialcharacter
source: Password must include at least one special character
ar: يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل

# passwordistoocommon
source: Password is too common. Please choose a more secure one
ar: كلمة المرور شائعة جدًا. الرجاء اختيار كلمة مرور أكثر أمانًا

source: Password should not contain your username
ar: يجب ألا تحتوي كلمة المرور على اسم المستخدم الخاص بك

source: Password should not contain parts of your email
ar: يجب ألا تحتوي كلمة المرور على جزء من بريدك الإلكتروني

source: Forgot your password?
ar: هل نسيت كلمة المرور؟

source: Remember me
ar: احفظ بيانات الدخول

source: This field is required
ar: هذه الخانة مطلوبه

source: Confirm password
ar: تأكيد كلمة المرور

source: Last name
ar: إسم العائلة

source: User name
ar: إسم المستخدم

# atleastletters
source: At least 3 letters
ar: الاسم يجب أن لا يقل عن حرفين

# passwordmustnotcontainyourorphonenumber
source: The password must not contain your name or phone number.
ar: لا يجب أن تحتوي كلمة المرور على اسمك أو رقم الهاتف.

source: The passwords do not match
ar: كلمتا المرور غير متطابقتين

# changePasswordTitle
source: Change Password
ar: تغيير كلمة المرور

# changePasswordSubtitle
source: You can now set a new password for your account. Make sure to choose a strong and memorable one.
ar: الآن يمكنك تعيين كلمة مرور جديدة لحسابك. احرص على اختيار كلمة مرور قوية وسهلة التذكر.

# newPasswordSlogan
source: New password new beginning
ar: كلمة مرور جديدة بداية جديدة

# otpSentMessage
source: We've sent a 5-digit verification code to your phone number. Please enter it to complete the registration.
ar: قد أرسلنا رمز تحقق مكونًا من 5 أرقام إلى رقم هاتفك الرجاء إدخاله لإكمال التسجيل

# otpSentMessageForgot
source: We've sent you a 5-digit verification code via SMS. Please enter it to continue and reset your password.
ar: أرسلنا إليك رمز تحقق مكوّنًا من 5 أرقام عبر رسالة نصية. الرجاء إدخاله للمتابعة وإعادة تعيين كلمة المرور

# otpSentSuccess
source: Code sent successfully
ar: تم إرسال الرمز بنجاح

# sendOtpButton
source: Send Verification Code
ar: إرسال رمز التحقق

# enterPhoneHint
source: Please enter the phone number associated with your account so we can send you a verification code via SMS.
ar: من فضلك أدخل رقم هاتفك المرتبط بحسابك لنتمكن من إرسال رمز التحقق إليك عبر رسالة نصية.

# forgotPasswordPrompt
source: Forgot your password? No worries, we're here to help.
ar: هل نسيت كلمة المرور؟ لا بأس، نحن هنا لمساعدتك.

# otpEmptyError
source: Please enter the verification code.
ar: الرجاء إدخال رمز التحقق.

# otpLengthError
source: The code must be 5 digits.
ar: يجب أن يتكون الرمز من 5 أرقام.

# tapToChange
source: Tap here to change
ar: اضغط هنا لتغييره

# enteredWrongNumber
source: Entered a wrong number?
ar: أدخلت رقمًا خاطئًا؟

source: Resend
ar: أعد الإرسال

# didNotReceiveCode
source: Didn't receive the code?
ar: لم يصلك الرمز؟

# resendCountdown
source: Resend in 00:{seconds}
ar: إعادة الإرسال خلال 00:{seconds}

# invalidEmail
source: Please enter a valid email address
ar: الرجاء إدخال عنوان بريد إلكتروني صالح

# congratsTitle
source: Congratulations! You have successfully created your account
ar: تهانينا! لقد أتممت إنشاء حسابك بنجاح

# congratsSubtitle
source: Your first step towards comprehensive healthcare starts now
ar: خطوتك الأولى نحو عناية صحية متكاملة تبدأ الآن

# congratsLoadingText
source: We're setting everything up for you now...
ar: نقوم بإعداد كل شيء لك الآن...

# medicalInfoTitle
source: Your health matters to us
ar: صحتك تهمنا

# medicalInfoSubtitle
source: Please provide us with your medical information.
ar: نرجى تزويدنا بمعلوماتك الطبية.

# chronicDiseasesHint
source: Chronic diseases
ar: الأمراض المزمنة

# previousSurgeriesHint
source: Previous surgeries
ar: العمليات الجراحية السابقة

# allergiesHint
source: Allergies
ar: الحساسية

# regularMedicationsHint
source: Regular medications
ar: الأدوية المستخدمة بانتظام

# bloodTypeTitle
source: Choose your blood type
ar: اختر نوع زمرة دمك

# profileInfoTitle
source: We want to know you better
ar: نرغب بالتعرف عليك أكثر

# profileInfoSubtitle
source: Please complete your personal information.
ar: فضلًا أكمل بياناتك الشخصية.

# emailHint
source: Email
ar: البريد الإلكتروني

# emailRequiredError
source: This field is required
ar: هذا الحقل مطلوب

# emailInvalidError
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# genderHint
source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

# genderRequiredError
source: Please select gender
ar: يرجى اختيار الجنس

# birthDateLabel
source: Date of Birth
ar: تاريخ الميلاد

# currentJobHint
source: Current Job
ar: الوظيفة الحالية

# jobRequiredError
source: This field is required
ar: هذا الحقل مطلوب

# nextButton
source: Next
ar: التالي

# locationTitle
source: Let's get closer to you
ar: لنكن أقرب إليك

# locationSubtitle
source: Enter your location and mark it on the map.
ar: أدخل موقعك وحدده على الخريطة.

# currentLocationHint
source: Your current location
ar: موقعك الحالي

# locationDescription
source: Enter your location or use the map to pinpoint your location accurately
ar: أدخل موقعك أو استخدم الخريطة لتحديد موقعك بدقة

# mapInstructions
source: Move the map or use current location to pinpoint your location accurately
ar: حرّك الخريطة أو استخدم الموقع الحالي لتحديد موقعك بدقة

# startNowButton
source: Start Now
ar: ابدأ الآن

# backButton
source: Back
ar: عودة

# uploadPhotoTitle
source: Please upload your photo.
ar: يرجى رفع صورتك.

# uploadPhotoDescription
source: It's preferred that the photo be clear and recent, showing the face clearly.
ar: يفضل أن تكون الصورة واضحة وحديثة، وتظهر الوجه بوضوح.

# resendOtpSuccessTitle
source: OTP sent successfully
ar: تم إرسال رمز التحقق بنجاح

# resendOtpSuccess
source: We've sent a 5-digit verification code to your phone number. Please enter it to complete the registration.
ar: لقد أرسلنا رمز تحقق مكوّنًا من 5 أرقام إلى رقم هاتفك الرجاء إدخاله لإكمال التسجيل

# otpVerifiedSuccessfullyTitle
source: OTP verified successfully
ar: تم التحقق من رمز التحقق بنجاح

# otpVerifiedSuccessfully
source: Your phone number has been verified successfully.
ar: تم التحقق من رقم هاتفك بنجاح.

# invalidOtpCodeTitle
source: Invalid OTP code
ar: رمز التحقق غير صالح

# invalidOtpCode
source: The verification code you entered is incorrect. Please try again.
ar: رمز التحقق الذي أدخلته غير صالح. الرجاء إعادة المحاولة.

# errorUnknown
source: An unknown error occurred. Please try again later.
ar: حدث خطأ غير معروف. الرجاء إعادة المحاولة.

# errorInvalidCredentials
source: Invalid credentials. Please try again.
ar: البيانات غير صالحة. الرجاء إعادة المحاولة.

# errorPhoneNotFound
source: Phone number not found. Please try again.
ar: رقم الهاتف غير موجود. الرجاء إعادة المحاولة.

# errorPhoneExists
source: Phone number already exists. Please try again.
ar: رقم الهاتف موجود بالفعل. الرجاء إعادة المحاولة.

# errorPhoneInvalid
source: Invalid phone number. Please try again.
ar: رقم الهاتف غير صالح. الرجاء إعادة المحاولة.

# errorNetwork
source: Network error. Please check your internet connection and try again.
ar: خطأ في الشبكة. الرجاء التحقق من اتصالك بالإنترنت وإعادة المحاولة.

# errorServer
source: Server error. Please try again later.
ar: خطأ في الخادم. الرجاء إعادة المحاولة.

# errorValidation
source: Validation error. Please check your input and try again.
ar: خطأ في التحقق. الرجاء التحقق من المدخلات وإعادة المحاولة.

# errorPhoneNotVerified
source: Phone number not verified. Please verify your phone number.
ar: رقم الهاتف غير موثوق. الرجاء التحقق من رقم الهاتف.

# operationFailedTitle
source: Operation failed
ar: فشل العملية

# operationFailed
source: An error occurred while performing the operation. Please try again.
ar: حدث خطأ أثناء العملية. الرجاء إعادة المحاولة.

# operationSuccessfulTitle
source: Operation successful
ar: تم العملية بنجاح

# login_success_message
source: You have successfully logged in! Welcome back
ar: تم تسجيل دخولك بنجاح! أهلاً بعودتك

# changePasswordSuccess
source: Your password has been changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

# changePasswordFailure
source: Failed to change password. Please try again.
ar: فشل تغيير كلمة المرور. الرجاء إعادة المحاولة.

# errorInvalidCredentialsTitle
source: Invalid credentials
ar: البيانات غير صالحة

# signUpFailureTitle
source: Sign up failed
ar: فشل إنشاء الحساب

# signUpFailure
source: An error occurred while signing up. Please try again.
ar: حدث خطأ أثناء إنشاء الحساب. الرجاء إعادة المحاولة.

# accountCreatedSuccess
source: Account created successfully
ar: تم إنشاء الحساب بنجاح

# accountCreatedSuccessSubtitle
source: You can now sign in to your account.
ar: يمكنك الآن تسجيل الدخول إلى حسابك.

# resendOtpFailedTitle
source: Failed to resend OTP
ar: فشل إعادة إرسال رمز التحقق

# resendOtpFailed
source: An error occurred while resending the OTP. Please try again.
ar: حدث خطأ أثناء إعادة إرسال رمز التحقق. الرجاء إعادة المحاولة.

# browse_specialties_and_book
source: Browse various specialties, rate doctors, and book appointments with ease.
ar: اطّلع على التخصصات المختلفة، وقيّم الأطباء، واحجز بكل سهولة.

# explore_and_choose_doctor
source: Explore doctors and choose the one that suits you best.
ar: استكشف الأطباء واختر الأنسب لك

# findRightDoctor
source: Find the right doctor for you
ar: ابحث عن الطبيب المناسب لك

source: Search history
ar: سجل البحث

source: Clear search history
ar: مسح سجل البحث

source: Undefined
ar: غير محدد

source: Experience
ar: الخبرة

# rate
source: Rating
ar: التقييم

source: Distance
ar: البعد

source: Descending
ar: تنازلي

source: Ascending
ar: تصاعدي

source: Registered Location
ar: موقعي المسجل

source: Sort By
ar: الترتيب حسب

source: Sort Type
ar: نوع الترتيب

source: Apply
ar: تطبيق

source: Locate
ar: تحديد الموقع

source: Distance (km)
ar: البعد (كم)

source: km
ar: كيلومتر

source: m
ar: متر

# filterSpecialty
source: Filter by Specialty
ar: فلترة حسب التخصص

# filterGender
source: Filter by Gender
ar: فلترة حسب الجنس

# location_services_disabled
source: Location services are disabled. Please enable them to continue.
ar: خدمات الموقع معطلة. الرجاء تفعيلها للمتابعة.

# location_permission_denied
source: Location permission was denied.
ar: تم رفض إذن الوصول للموقع.

# location_permission_denied_forever
source: Location permission was permanently denied. Please enable it from the app settings.
ar: تم رفض إذن الموقع بشكل دائم. يرجى تفعيله من إعدادات التطبيق.

# permissions_error_title
source: Permissions Error
ar: خطأ في الأذونات

source: Authentication failed
ar: فشلت عملية المصادقة

source: reviews
ar: تقييم

# server_error
source: An unexpected error occurred. Please try again later
ar: حدث خطأ غير متوقع. يرجى المحاولة لاحقًا

# no_doctor_found
source: We couldnt find any doctor matching your search. Try different keywords or check your spelling
ar: لم نجد أي طبيب يطابق بحثك. جرّب كلمات أخرى أو تحقق من الإملاء

source: profile
ar: ملف

source: D
ar: د

source: Clinic location
ar: موقع العيادة

# easilyLocateClinic
source: Easily locate the clinic, and find your way there
ar: اعرف مكان العيادة بسهولة، وحدّد طريقك إليها

# oneClick
source: With one click.
ar: بنقرة واحدة.

source: Clinic photos
ar: صور العيادة

# noClinicImage
source: Sorry, no photos are available for this clinic.
ar: عذرًا، لا توجد صور متاحة لهذه العيادة.

# clinicEvaluation
source: Overall Clinic Evaluation
ar: التقييم العام للعيادة

# realPastPatients
source: Real reviews from past patients
ar: آراء حقيقية من مرضى سابقين

source: View more
ar: عرض المزيد

source: About
ar: نبذة

# placeStudy
source: Place of study
ar: مكان الدراسة

# aboutDoctor
source: About the doctor
ar: عن الطبيب

# show_all_days
source: Show all days of the month
ar: عرض جميع أيام الشهر

source: Select booking time
ar: اختر ميعاد الحجز

source: Book now
ar: احجز الآن

source: Available
ar: متاح

# remainingAppointmentsMessage
source: {remainingCount} appointments still available for today
ar: ما زال هناك {remainingCount} مواعيد متاحة لهذا اليوم

# noAppointmentsMessage
source: No appointments available
ar: لا يوجد مواعيد متاحة

source: No appointments
ar: لا توجد مواعيد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: AM
ar: صباحاً

source: PM
ar: مساءً

# error
source: Something went wrong
ar: حدث خطأ

# locationError
source: An error occurred while detecting the location
ar: حدث خطأ أثناء تحديد الموقع

source: Route not found
ar: المسار غير موجود

# locationTimeout
source: Location request timed out
ar: انتهى وقت محاولة تحديد الموقع

source: Quota exceeded
ar: تم تجاوز الحد المسموح

source: API key error
ar: خطأ في مفتاح API

# routeError
source: An error occurred while fetching the route
ar: حدث خطأ أثناء جلب المسار

source: No route found
ar: لم يتم العثور على أي مسار

source: Your location
ar: موقعك الحالي

source: Loading route...
ar: جارٍ تحميل المسار...

# errorOccurred
source: Sorry, an error occurred. Please try again
ar: نعتذر، حدث خطأ ما. الرجاء إعادة المحاولة

source: Retry
ar: إعادة المحاولة

source: Age
ar: العمر

source: Subspecialties
ar: الاختصاصات الفرعية

# noCommentDoctor
source: No one has left a comment yet. Book now and be the first to review this doctor!
ar: لم يترك أحد تعليقاً بعد. احجز الآن وكن أول من يقيّم هذا الطبيب!

# doctor_added_success
source: Doctor added to favorites successfully
ar: تمت إضافة الطبيب إلى المفضلة بنجاح

# doctor_added_failure_network
source: Failed to add doctor to favorites due to connection issues
ar: تعذر إضافة الطبيب إلى المفضلة بسبب مشاكل في الاتصال

# doctor_added_failure_auth
source: You cannot add the doctor to favorites because you are not logged in
ar: لا يمكنك إضافة الطبيب إلى المفضلة لأنك لم تسجل الدخول

# failure_title
source: Error
ar: حدث خطأ

# success_title
source: Success
ar: تم بنجاح

# doctor_removed_success
source: Doctor removed from favorites successfully
ar: تم حذف الطبيب من المفضلة بنجاح

source: View All Reservations
ar: عرض جميع الحجوزات

# near_appointments
source: Nearby Appointments
ar: المواعيد القريبة

# appointments_expired
source: Nearby appointments have ended. You can press "View all reservations" to choose the date and month that suits you.
ar: انتهت المواعيد القريبة. يمكنك الضغط على "عرض جميع الحجوزات" لاختيار التاريخ والشهر المناسب لك.

source: Appointments Calendar
ar: تقويم المواعيد

source: Cancel
ar: إلغاء

source: Select
ar: اختيار

source: Choose Month
ar: اختر الشهر

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: No appointments available
ar: لا توجد مواعيد متاحة

# no_appointments_description
source: No appointments found for this month
ar: لم يتم العثور على أي مواعيد في هذا الشهر

source: Error loading appointments
ar: خطأ في تحميل المواعيد

source: Please try again
ar: يرجى المحاولة مرة أخرى

source: Available Appointments
ar: المواعيد المتاحة

source: appointment
ar: موعد

source: Loading appointments...
ar: جاري تحميل المواعيد...

source: Available Days
ar: الأيام المتاحة

source: Day
ar: يوم

source: Days
ar: أيام

# appointmentInstructions
source: You can write anything you want the doctor to know before the appointment, such as symptoms you feel, when your condition started, or any details you think are important.
ar: يمكنك هنا كتابة أي شيء ترغب في أن يعرفه الطبيب قبل الموعد، مثل الأعراض التي تشعر بها، متى بدأت حالتك، أو أي تفاصيل تعتقد أنها مهمة.

# tellDoctorHowYouFeel
source: Tell the doctor how you feel
ar: أخبر الطبيب بما تشعر به

source: Confirm Booking
ar: تأكيد الحجز

# bookingSuccess
source: Your appointment has been successfully booked!
ar: تم حجز موعدك بنجاح!

# thankYouMessage
source: Thank you for using our platform. We wish you continued health and wellness!
ar: شكرًا لاستخدامك منصتنا. نتمنى لك دوام الصحة والعافية!

# attachFiles
source: You can attach any files you want the doctor to review before the appointment
ar: يمكنك إرفاق أي ملفات ترغب أن يطّلع عليها الطبيب قبل الموعد

source: Back to Home
ar: العودة إلى الصفحة الرئيسية

# availableAppointments
source: These are the available appointments for {dayDate}. Please select a time that suits you.
ar: هذه هي المواعيد المتاحة ليوم {dayDate}، يرجى اختيار الوقت المناسب لك.

# chooseTime
source: Choose a suitable time
ar: اختر الوقت المناسب

# appointment_success
source: Your appointment has been successfully booked!
ar: تم حجز موعدك بنجاح!

# thank_you_message
source: Thank you for using our platform. We wish you good health and wellness!
ar: شكرًا لاستخدامك منصتنا. نتمنى لك دوام الصحة والعافية!

# attach_files_hint
source: You can attach any files you would like the doctor to review before the appointment
ar: يمكنك إرفاق أي ملفات ترغب أن يطّلع عليها الطبيب قبل الموعد

source: Doctor:
ar: الطبيب:

source: Specialization:
ar: التخصص:

source: Date:
ar: التاريخ:

source: Time:
ar: الوقت:

source: Location:
ar: المكان:

source: Add File
ar: أضف ملف

source: Back to Home
ar: العودة إلى الصفحة الرئيسية

source: Appointment confirmed
ar: تم تأكيد الموعد

# max_files_error
source: You cannot upload more than {maxFiles} files
ar: لا يمكن رفع أكثر من {maxFiles} ملفات

# file_size_error
source: The file {fileName} is larger than {maxFileSizeInMB} MB
ar: حجم الملف {fileName} أكبر من {maxFileSizeInMB} ميجابايت

# allowed_files_limit
source: {allowedCount} files were added only. Maximum allowed is {maxFiles} files
ar: تم إضافة {allowedCount} ملفات فقط. الحد الأقصى {maxFiles} ملفات

# file_pick_error
source: An error occurred while picking files
ar: حدث خطأ في اختيار الملفات

source: Loading...
ar: جاري التحميل...

source: Tap to select files
ar: اضغط لاختيار الملفات

# upload_hint
source: You can upload up to {maxFiles} files, each up to {maxFileSizeInMB} MB
ar: يمكنك رفع حتى {maxFiles} ملفات، كل ملف حتى {maxFileSizeInMB} ميجابايت

# supported_formats
source: Supported formats: PDF, DOC, DOCX, TXT, JPG, PNG
ar: الصيغ المدعومة: PDF, DOC, DOCX, TXT, JPG, PNG

# files_progress
source: {selectedCount} of {maxFiles} files
ar: {selectedCount} من {maxFiles} ملفات

# appointment_not_available
source: Unfortunately, the appointment you tried to book is no longer available as it has been taken by another patient.
ar: للأسف، الموعد الذي حاولت حجزه لم يعد متاحاً لأنه تم حجزه من مريض آخر.

# files_uploaded_success
source: Files uploaded successfully! Your doctor can now review them.
ar: تم رفع الملفات بنجاح! سيتمكن طبيبك من الاطلاع عليها.

# files_upload_error
source: There was a problem uploading the files. Please try again.
ar: حدثت مشكلة أثناء رفع الملفات. يرجى المحاولة مرة أخرى.

# invalid_uploaded_file
source: One of the uploaded files is invalid or contains an issue. Please check your files and try again.
ar: أحد الملفات التي قمت برفعها غير صالح أو يحتوي على مشكلة. يرجى التحقق من الملفات والمحاولة مرة أخرى.

# next_appointment_message
source: Your next appointment is waiting for you. We wish you continued health and wellness.
ar: موعدك القادم في انتظارك. نتمنى لك دوام الصحة والعافية.

# reservationCanceledSuccess
source: You have successfully canceled this reservation.
ar: لقد قمت بإلغاء هذا الحجز بنجاح.

source: All Reservations
ar: جميع الحجوزات

source: Current Reservations
ar: الحجوزات الحالية

source: Past Reservations
ar: الحجوزات السابقة

source: Canceled Reservations
ar: الحجوزات الملغاة

source: Rebook
ar: إعادة الحجز

# loginRequiredForCurrentReservations
source: You cannot view current reservations because you are not logged in yet. Please log in to enjoy all the app features.
ar: لا يمكنك عرض الحجوزات الحالية لأنك لم تقم بتسجيل الدخول بعد. سجّل الدخول واستفد من جميع ميزات التطبيق.

source: Edit
ar: تعديل

source: Reschedule
ar: تغيير الموعد

source: Cancel Reservation
ar: إلغاء الحجز

# sessionFeedbackTitle
source: How was your session? Rate your experience with us!
ar: كيف كانت جلستك؟ قيّم تجربتك معنا!

# sessionFeedbackSubtitle
source: Share your feedback to help others.. What did you like or dislike?
ar: شاركنا رأيك ليساعد غيرك.. ما الذي أعجبك أو لم يعجبك؟

source: Send
ar: إرسال

source: Map
ar: الخريطة

source: Rate Doctor
ar: قيّم الطبيب

source: Details
ar: تفاصيل

source: Call
ar: اتصال

# callErrorTitle
source: Sorry, we couldn't make the call
ar: عذرًا، لم نتمكن من إجراء المكالمة

# callErrorMessage
source: Failed to open the call app. Please try again later or dial manually.
ar: تعذّر فتح تطبيق الاتصال. جرّب لاحقًا أو اتصل يدويًا.

# missed_reservation
source: You missed this reservation. We hope you can attend next time.
ar: لم تحضر هذا الحجز. نتمنى أن تتمكن من الحضور في المرات القادمة.

# ratingFailed
source: Your rating could not be submitted due to an error. Please try again later.
ar: لم يتم رفع تقييمك بسبب حدوث خطأ، يرجى المحاولة لاحقًا.

# ratingSuccess
source: Your rating has been submitted successfully. Thank you!
ar: تم رفع تقييمك بنجاح، شكرًا لك!

# alreadyRatedOrCommented
source: Rated
ar: تم التقييم

# visitCompleted
source: Your visit has been completed successfully. Wishing you good health and wellness!
ar: تمت زيارتك بنجاح. نتمنى لك دوام الصحة والعافية!

# noNotes
source: No notes recorded
ar: لا توجد ملاحظات مسجلة

source: Patient Notes
ar: ملاحظات المريض

# appointmentInfo
source: Appointment Information
ar: معلومات الموعد

source: Doctor Name:
ar: اسم الطبيب:

# doctorInfo
source: Doctor Information
ar: معلومات الطبيب

source: Appointment Details
ar: تفاصيل الموعد

source: Address:
ar: العنوان:

source: Clinic Number:
ar: رقم العيادة:

source: Queue
ar: الطابور

# cancellationSuccess
source: The appointment has been cancelled successfully.
ar: تم إلغاء الموعد بنجاح.

# cancellationFailed
source: The appointment could not be cancelled. Please try again later.
ar: لم يتم إلغاء الموعد. يرجى المحاولة لاحقًا.

# updateBookingSuccess
source: Your booking has been updated successfully.
ar: تم تعديل حجزك بنجاح.
